# flake8: noqa

# 1 Типы данных
#   str/int/float

# Переменная
# Тип данных
# Объект
# Сущность

ebanaya_peremennaya_govna = 5020
peremennaya = 10  # int
peremennaya2 = 10.129308  # float
peremennaya3 = "abab"  # str


# 2 Вывод на экран. print()
#   Узнать тип данных type()
#   str() и int() и float()

# Функция
# Параметр
# Передача
# Возврат


p = str(10)
print(type(p))
print(p)


# 3 Операторы сложения и вычитания, деления
# Оператор

a = peremennaya + peremennaya2
b = peremennaya - peremennaya2
c = peremennaya/peremennaya2
print(a)
print(b)
print(c)










# Задача 1:
# 	Объяви три переменные:
# 		Переменная типа int = 15
# 		Переменная типа float = 7.5
# 		Переменная типа str = хуй дроченый

# 	1. Выведи каждую переменную на экран с помощью print().
# 	2. Вычислите сумму и разность двух числовых переменных (int и float) с использованием операторов + и -, затем  выведи полученные результаты.
# 	3. Так же выведи фразы.
# 		Хуй дроченный = сумме двух чисел см
# 		Хуй дроченный = разности двух чисел см


# Задача 2:
# 	Дан список температур в строках:
# 	a = "23.5"
# 	b = "25.0"
# 	c = "21.7"
# 	d = "22.9"

# 	Преобразуй их в числа и выведи среднюю температуру.


# a = "23.5"
# b = "25.0"
# c = "21.7"
# d = "22.9"
# e = float(a) + float(b) + float(c) + float(d)
# print(e/4)