# flake8: noqa

# Булевы значения True, False
# Отдельный тип данных

a = True  # bool
b = False  # bool

# Операторы сравнения ==, !=, >, <, >=, <=
# Как  работают и что возвращают

# Условные конструкции, как программа «делает выбор»
# if, else, elif


# Задача 1. Абаб против Абоба
# 	У нас есть два героя: Абаб и Абоб.
# 	Они соревнуются, кто выдавит большую какашку.
# 	В переменной abab_poop — масса какашки Абаба.
# 	В переменной abob_poop — масса какашки Абоба.

# 	Если Абаб победил выводим: "Абаб выдавил как чемпион!"
# 	Если Абоб победил выводим: "Абоб доминирует!"
# 	Если ничья выводим: "Одинаково мерзкие!"

# 	Пример:

# 		Входные данные:
# 		abab_poop = 120
# 		abob_poop = 95

# 		Ожидаемый вывод:
# 		Абаб выдавил как чемпион!


# Задача 2. Санчес и духовный путь
# 	У Санчеса есть духовный уровень (spiritual_level).
# 	Если он больше 7.5 выводим: "Санчес — Ачария Брахмачария".
# 	Если он меньше 3 выводим: "Санчес — Подпивас".
# 	Если уровень от 3 до 7.5 включительно выводим: "Санчес — ЛФТ".

# 	Пример:

# 		Входные данные:
# 		spiritual_level = 3.1

# 		Ожидаемый вывод:
# 		Санчес — ЛФТ


# Задача 3. Настоящий Путин?
# 	На инаугурацию приехал Путин. Или это не Путин?
# 	В переменной putin_width задана ширина Путина.
# 	Ширина Путина может рассказать, настоящий ли он.

# 	Если ширина больше 120, включительно — это настоящий широкий Путин, выводим "Широкий Путин шагает под Song for Denise".
# 	Если от 90 до 120 — это обычный Путин, выводим "Обычный Путин на официальной встрече".
# 	Если меньше 90, включительно — это неудачный двойник, выводим "Неудачный двойник Путина. Срочно спрятать".


# 	Пример:

# 		Входные данные:
# 		putin_width = 135

# 		Ожидаемый вывод:
# 		Широкий Путин шагает под Song for Denise.
